status/2020/10oct20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-17 Sat 07:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Kelley" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc844b25">1. Live Oak Weather Station</a>
<ul>
<li><a href="#org17d608e">1.1. Raspberry Pi Zero W</a></li>
<li><a href="#org5a3bb15">1.2. Adafruit ESP8266</a></li>
<li><a href="#orgb43c6b5">1.3. Sensor bringup</a></li>
<li><a href="#orgead3f25">1.4. Sensor Enclosure</a></li>
<li><a href="#orgc0b0be0">1.5. Location</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
03 October 2020 - 09 October 2020
</p>

<div id="outline-container-orgc844b25" class="outline-2">
<h2 id="orgc844b25"><span class="section-number-2">1</span> Live Oak Weather Station</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org17d608e" class="outline-3">
<h3 id="org17d608e"><span class="section-number-3">1.1</span> Raspberry Pi Zero W</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Got Buildroot running on Raspberry Pi Zero W. It's a continuing
mystery why the MAC address changed a couple of times; setting the MAC
explicitly appears to stop it from changing.
</p>

<p>
See
</p>

<p>
<a href="https://raspberrypi.stackexchange.com/questions/68513/pi-using-a-random-mac-address-after-every-reboot-how-do-i-stop-this-behavior">https://raspberrypi.stackexchange.com/questions/68513/pi-using-a-random-mac-address-after-every-reboot-how-do-i-stop-this-behavior</a>
</p>

<p>
Interfacing the sensors to the RPI0W is going to require another board
because the particle sensor needs a UART and I don't want to use a
soft UART or the console UART for it, and the anenometer needs an A/D.
</p>

<p>
I'd love to write the whole weather-station suite, but I'll probably
just get WeeWX running instead which is what I use for my Alum Rock
weather station.
</p>
</div>
</div>

<div id="outline-container-org5a3bb15" class="outline-3">
<h3 id="org5a3bb15"><span class="section-number-3">1.2</span> Adafruit ESP8266</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I was originally going to use the Adafruit ESP8266 board, but it stopped
working on RIOT OS because of <a href="https://github.com/RIOT-OS/RIOT/issues/15137">https://github.com/RIOT-OS/RIOT/issues/15137</a>
</p>

<p>
The search continues for a small 802.11 interface with no binary blobs.
</p>
</div>
</div>

<div id="outline-container-orgb43c6b5" class="outline-3">
<h3 id="orgb43c6b5"><span class="section-number-3">1.3</span> Sensor bringup</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Sensors are being brought up on a Nucleo-F303RE using RIOT OS.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Plantower PMS5003 Particulate Monitor</td>
<td class="org-left">done</td>
</tr>

<tr>
<td class="org-left">BME 680</td>
<td class="org-left">done</td>
</tr>

<tr>
<td class="org-left">Sparkfun DS-15901 Rain Gauge</td>
<td class="org-left">TODO</td>
</tr>

<tr>
<td class="org-left">Sparkfun DS-15901 Wind Vane</td>
<td class="org-left">hooked up to ADC</td>
</tr>

<tr>
<td class="org-left">Sparkfun DS-15901 Anenometer</td>
<td class="org-left">TODO</td>
</tr>

<tr>
<td class="org-left">VEML6075 UV Sensor</td>
<td class="org-left">TODO</td>
</tr>
</tbody>
</table>

<p>
This will probably change to something Arduino-like for RPI0W
interfacing via SPI.
</p>

<p>
Apparently the VEML6075 is no longer in production. An outstanding
question is how to protect the sensor from the elements. My original
plan was to break apart some old UV-erasble EPROMS for the quartz
windows, but an app-note for Si1133 UV sensor ("Not recommended for
new designs" but don't know what the replacement is) uses Teflon FEP
films. Looking at Teflon datasheets does appear to show that some
Teflon films are reasonably transparent to UV. The question here is
how to avoid spending $50 for a square inch of cover.
</p>
</div>
</div>

<div id="outline-container-orgead3f25" class="outline-3">
<h3 id="orgead3f25"><span class="section-number-3">1.4</span> Sensor Enclosure</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Planning to hang the sensors off the DS-15901 mast, using something
that looks like a circular Stevenson screen. There's a name for it
that I can't find right now. Started outlining the design using
swocer.
</p>
</div>
</div>

<div id="outline-container-orgc0b0be0" class="outline-3">
<h3 id="orgc0b0be0"><span class="section-number-3">1.5</span> Location</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Trish suggested using the roof corner off the quilt room as there's an
electrical outlet below the corner. I can use some 1/2 EMT to attach
the mast to the eaves. Did a 24hr test communications run with the
RPI0W outside. Link not terrible.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2020-10-17 Sat 07:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
